---
kind: type
id: T:Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment
source: html/64b45968-97cf-a797-09a6-4583ad9069f7.htm
---
# Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment

Represents an analytical segment of the MEP analytical model.

## Syntax (C#)
```csharp
public class MEPAnalyticalSegment : IDisposable
```